{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Xqd0DzHaiyRqVH3WRG7hzg", "review_id": "15SdjuK7DmYqUAj6rjGowg", "text": "dr. goldberg offers everything i look for in a general practitioner.  he's nice and easy to talk to without being patronizing; he's always on time in seeing his patients; he's affiliated with a top-notch hospital (nyu) which my parents have explained to me is very important in case something happens and you need surgery; and you can get referrals to see specialists without having to see him first.  really, what more do you need?  i'm sitting here trying to think of any complaints i have about him, but i'm really drawing a blank.", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA", "label": "Food-irrelevant", "stars": 5, "date": "2007-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "H1kH6QZV7Le4zqTRNxoZow", "review_id": "RF6UnRTtG7tWMcrO2GEoAg", "text": "Unfortunately, the frustration of being Dr. Goldberg's patient is a repeat of the experience I've had with so many other doctors in NYC -- good doctor, terrible staff.  It seems that his staff simply never answers the phone.  It usually takes 2 hours of repeated calling to get an answer.  Who has time for that or wants to deal with it?  I have run into this problem with many other doctors and I just don't get it.  You have office workers, you have patients with medical needs, why isn't anyone answering the phone?  It's incomprehensible and not work the aggravation.  It's with regret that I feel that I have to give Dr. Goldberg 2 stars.", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA", "label": "Food-irrelevant", "stars": 2, "date": "2010-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "zvJCcrpm2yOZrxKffwGQLA", "review_id": "-TsVN230RCkLYKBeLsuz7A", "text": "Dr. Goldberg has been my doctor for years and I like him.  I've found his office to be fairly efficient.  Today I actually got to see the doctor a few minutes early!  \n\nHe seems very engaged with his patients and his demeanor is friendly, yet authoritative.    \n\nI'm glad to have Dr. Goldberg as my doctor.", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA", "label": "Food-irrelevant", "stars": 4, "date": "2012-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KBLW4wJA_fwoWmMhiHRVOA", "review_id": "dNocEAyUucjT371NNND41Q", "text": "Been going to Dr. Goldberg for over 10 years. I think I was one of his 1st patients when he started at MHMG. He's been great over the years and is really all about the big picture. It is because of him, not my now former gyn Dr. Markoff, that I found out I have fibroids. He explores all options with you and is very patient and understanding. He doesn't judge and asks all the right questions. Very thorough and wants to be kept in the loop on every aspect of your medical health and your life.", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA", "label": "Food-irrelevant", "stars": 4, "date": "2012-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "zvJCcrpm2yOZrxKffwGQLA", "review_id": "ebcN2aqmNUuYNoyvQErgnA", "text": "Got a letter in the mail last week that said Dr. Goldberg is moving to Arizona to take a new position there in June.  He will be missed very much.  \n\nI think finding a new doctor in NYC that you actually like might almost be as awful as trying to find a date!", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA", "label": "Food-irrelevant", "stars": 4, "date": "2012-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Qrs3EICADUKNFoUq2iHStA", "review_id": "_ePLBPrkrf4bhyiKWEn4Qg", "text": "I don't know what Dr. Goldberg was like before  moving to Arizona, but let me tell you, STAY AWAY from this doctor and this office. I was going to Dr. Johnson before he left and Goldberg took over when Johnson left. He is not a caring doctor. He is only interested in the co-pay and having you come in for medication refills every month. He will not give refills and could less about patients's financial situations. Trying to get your 90 days mail away pharmacy prescriptions through this guy is a joke. And to make matters even worse, his office staff is incompetent. 90% of the time when you call the office, they'll put you through to a voice mail, that NO ONE ever answers or returns your call. Both my adult children and husband have decided to leave this practice after experiencing such frustration. The entire office has an attitude like they are doing you a favor. Give me a break! Stay away from this doc and the practice. You deserve better and they will not be there when you really need them. I have never felt compelled to write a bad review about anyone until I met this pathetic excuse for a doctor who is all about the money.", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA", "label": "Food-irrelevant", "stars": 1, "date": "2013-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jE5xVugujSaskAoh2DRx3Q", "review_id": "kMu0knsSUFW2DZXqKkGWlg", "text": "Top notch doctor in a top notch practice. Can't say I am surprised when I was referred to him by another doctor who I think is wonderful and because he went to one of the best medical schools in the country. \nIt is really easy to get an appointment. There is minimal wait to be seen and his bedside manner is great.", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA", "label": "Food-irrelevant", "stars": 5, "date": "2014-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QnhQ8G51XbUpVEyWY2Km-A", "review_id": "onDPFgNZpMk-bT1zlForRA", "text": "Dr. Eric Goldberg is a fantastic doctor who has correctly diagnosed every issue that my wife and I have had. Unlike many of my past doctors, Dr. Goldberg is very accessible and we have been able to schedule appointments with him and his staff very quickly. We are happy to have him in the neighborhood and look forward to being his patients for many years to come.", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA", "label": "Food-irrelevant", "stars": 5, "date": "2014-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zvNimI98mrmhgNOOrzOiGg", "review_id": "I7Kte2FwXWPCwdm7ispu1A", "text": "Pretty good dinner with a nice selection of food. Open 24 hours and provide nice service. I usually go here after a night of partying. My favorite dish is the Fried Chicken Eggs Benedict.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "label": "Food-relevant", "stars": 4, "date": "2008-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p4ySEi8PEli0auZGBsy6gA", "review_id": "9uHZyOu5CTCDl1L6cfvOCA", "text": "Good truck stop dining at the right price. We love coming here on the weekends when we don't feel like cooking.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "label": "Food-relevant", "stars": 4, "date": "2009-05-03", "type": "review"}
{"votes": {"funny": 6, "useful": 0, "cool": 0}, "user_id": "ZYaumz29bl9qHpu-KVtMGA", "review_id": "ow1c4Lcl3ObWxDC2yurwjQ", "text": "If you like lot lizards, you'll love the Pine Cone!", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "label": "Food-relevant", "stars": 4, "date": "2009-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SvS7NXWG2B2kFoaHaWdGfg", "review_id": "FRTCszJWkJonDAZx3yr8FA", "text": "Enjoyable experience for the whole family. The wait staff was courteous and friendly; the food was reasonably priced and a good value. A word of advice--LEAVE ROOM FOR DESSERT! the deserters are great but huge! Plan to bring some home", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "label": "Food-relevant", "stars": 4, "date": "2010-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qOYI9O0ecMJ9VaqcM9phNw", "review_id": "qQIvtbqUujvvnJDzPSfmFA", "text": "One of my favorite truck stop diners with solid food and friendly, quick service. My god, those desserts are huge! I can't imagine eating that giant cream puff. \nAll the food we had was delicious and I love how they leave a carafe of coffee on the table. Love this place. Would definitely be back if I was in the area!", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "label": "Food-relevant", "stars": 4, "date": "2011-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EEYwj6_t1OT5WQGypqEPNg", "review_id": "4iPPOQIo5Mr1NAUPUgCUrQ", "text": "Only went here once about a year and a half ago, but they had great pancakes! My only problem with it at the time was that they allowed smoking, so I left smelling like a cigarette. With the change in law, I'm sure the atmosphere has improved!", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "label": "Food-relevant", "stars": 4, "date": "2011-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bfww9ItvUBeRsFQ4UD4eaw", "review_id": "Rnm1KyfRcwNt9bOI5i-yqA", "text": "Great truck stop restaurant.  I've had breakfast and dinner here and it has always been good.  Huge portions and reasonable prices.  The bakery I guess is legendary.  They have doughnuts the size of your head!  Eclairs the size of your arm and Cream Puffs that are about 10\" high.  On our most recent trip in the area, stopped at the gas station attached to the restaurant fo some quick snacks and of course BAKERY.\n\nIf you are driving by and see the sign for The Pine Cone Restaurant - Take the next off ramp and stop it.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "label": "Food-relevant", "stars": 4, "date": "2011-11-08", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 0}, "user_id": "Au3Qs-AAZEWu2_4gIMwRgw", "review_id": "SSlO5u2nIJ8PoAKAgN5m3Q", "text": "Yeah, thats right a five freakin star rating.  \n\nFive Star Truck Stop Dining At Its Finest.\n\nBe prepared to eat.  \n\nI was first introduced to the Pine Cone at its Johnson Creek location years ago and freaked out at the size of the awesome, delicious desserts.   Then on a recent road trip someone mentioned about eating at the Pine Cone, I thought is there really more than one?  I looked out the window to see exactly where we were at and it wasn't near Johnson Creek -- when we arrived, and I saw the bakery....I knew I was home.\n\nIt was near dinner time so I ordered stuffed chicken breast.  The dinner roll alone is a meal.  I can't say enough about dinner.  Everything is homemade. They don't add alot of salt, if any.  You can tell its fresh.  Its plentiful.  Its cheap.  You literally can stuff yourself for next to nothing.\n\nYou can't possibly leave this place without indulging on some bakery goods to take home, IF they can make it home.  In our case, they were safely packed in the trunk for our safety and yours.  The last thing we need to explain to the police is we were under the influence of bakery goods from the Pine Cone.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "label": "Food-relevant", "stars": 5, "date": "2011-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MnXcXwr0keJpkIiwuPsOKg", "review_id": "_utPYHIdXeq8CqQ4iYD1bw", "text": "Ate a Saturday morning breakfast at the Pine Cone.  Friendly,quick service, normal prices.  But for the new year - the special was all-you-can-eat pancakes for $2.12, I added a breakfast sausage patty ($3.00).  Father had the typical, two eggs, toast, hash-bowns (seem fresh cut), sausage links.  Food was tasty, no major qualms other than - the hash-browns need a bit more cooking and the coffee needs a bit more bite.\n\nvery nice assortment of bakes goods - massive - as large as your head cream-puffs, eclairs - I took a blueberry muffin to go - which I enjoyed.  \n\nQuick exit from I-94...just northeast of  Madison", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "label": "Food-relevant", "stars": 3, "date": "2012-01-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "-hwN2juKYn-KTxa2WBYLnw", "review_id": "6wFJ0Ml7r9elqjeoez3HXQ", "text": "Attention fans of David Lynch.  Do stop by this place.  The atmosphere, staff and patrons will certainly help to make your visit enjoyable.\nLast time I was here I ordered the caramel nut covered cinnamon roll.  The waitress asked if I wanted it warmed with some butter.   I thought that sounded even better and said to go ahead and do that.  She nodded agreement.  Then when she brought it to me it was unheated and no butter.   Odd but also kind of humorous.  I always enjoy being in a David Lynch film from time to time.\nThe service and food is way better than the country restaurant just a mile south on 51.  Be sure to go here instead.   Their booths are made for skinny people from the 50s.   take a table.  start a conversations with the truck driver to your left. \nWe used to go to the Pine Cone when it was across the street.  Must be hard times for these guys because the interior appears to be older than what they had when they were on the other side of the street.   That place now sits empty.   Why is this area depressed?   Don't ask me, I don't know.  Do I look like I have all the answers?\nThe food here is good and the prices are cheap.   Go here for a nice meal and a flash back to the past and don't forget to take home some bakery.  Or if you aren't hungry just stop by for some great baked goods.    Well worth the stop.\nThis place gets four stars because of their five star bakery selection.  Crazy big cinnamon rolls and good prices.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "label": "Food-relevant", "stars": 4, "date": "2012-01-08", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 1}, "user_id": "MPKMK36Xp0GuaWaXlUwZ8Q", "review_id": "rgM9f8Xh6ySclVoOSR8MXw", "text": "i rarely give five star reviews but for what this restaurant is, it's pretty perfect.  i've only eaten breakfast here (twice in the last three weeks) and the eggs are cooked perfectly, the sourdough toast is made in the kitchen and is delicious, and the bacon was perfectly crispy.  the hashbrowns are the best i've had in a long time - perfectly crispy on the outside and fluffy inside.  the pancakes are huge and light and amazing.  the cinnamon rolls taste just as good as they look.\n\nprices are right on, baked goods are pretty great.  service is fast and friendly - really fast.  i haven't had to wait more than 5 minutes to get my meal.  i might be in the honeymoon phase, but perfectly cooked poached eggs or over easy eggs are hard to come by!  it shouldn't be an anomaly to discover well cooked food, but i suppose it is.  sure it's a \"greasy spoon\" but how many greasy spoons bake their own bread?  can't recommend this place enough for great breakfasts.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "label": "Food-relevant", "stars": 5, "date": "2012-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pgKOL4k5tWCWS9VIc33EoQ", "review_id": "khGSK7FRLuRWnnTE6I0stA", "text": "With a recent addition of a truck driver for a BF I have found myself frequenting truck stops to dine. This little place is quite a pleasant surprise. Basically it is just great home cooking. Everything is homemade and quite good. The baked goods in the front counter were amazing. The size of the cinnamon rolls was insane. And of course I couldn't leave without a piece of pie.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "label": "Food-relevant", "stars": 4, "date": "2012-02-16", "type": "review"}
